update/sys_soap_message_function_bcf42d994f003300f94a00fe9310c75c.xml

<?xml version="1.0" encoding="UTF-8"?><record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc="urn:com.workday/bsvc">
   <soapenv:Header>
      <bsvc:Workday_Common_Header>
         <!--Optional:-->
         <bsvc:Include_Reference_Descriptors_In_Response>${Workday_Common_Header.Include_Reference_Descriptors_In_Response}</bsvc:Include_Reference_Descriptors_In_Response>
      </bsvc:Workday_Common_Header>
   </soapenv:Header>
   <soapenv:Body>
      <bsvc:Put_Disability_Request bsvc:Add_Only="${Put_Disability_Request}" bsvc:version="${Put_Disability_Request}">
         <!--Optional:-->
         <bsvc:Disability_Reference bsvc:Descriptor="${Put_Disability_Request.Disability_Reference}">
            <!--Zero or more repetitions:-->
            <bsvc:ID bsvc:type="${Disability_Reference.ID}">${Disability_Reference.ID}</bsvc:ID>
         </bsvc:Disability_Reference>
         <bsvc:Disability_Data>
            <!--Optional:-->
            <bsvc:ID>${Disability_Data.ID}</bsvc:ID>
            <!--Optional:-->
            <bsvc:Name>${Disability_Data.Name}</bsvc:Name>
            <!--Optional:-->
            <bsvc:Code>${Disability_Data.Code}</bsvc:Code>
            <!--Optional:-->
            <bsvc:Description>${Disability_Data.Description}</bsvc:Description>
            <!--Optional:-->
            <bsvc:Location_Reference bsvc:Descriptor="${Disability_Data.Location_Reference}">
               <!--Zero or more repetitions:-->
               <bsvc:ID bsvc:type="${Location_Reference.ID}" bsvc:parent_id="${Location_Reference.ID}" bsvc:parent_type="${Location_Reference.ID}">${Location_Reference.ID}</bsvc:ID>
            </bsvc:Location_Reference>
            <!--Optional:-->
            <bsvc:Inactive>${Disability_Data.Inactive}</bsvc:Inactive>
         </bsvc:Disability_Data>
      </bsvc:Put_Disability_Request>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>Put_Disability</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>asdas [ Put_Disability ]</qualified_name>
        <soap_action/>
        <soap_endpoint>https://wd5-impl-services1.workday.com/ccx/service/loandepot1/Human_Resources/v31.0</soap_endpoint>
        <soap_message display_value="asdas">dcd4e5994f003300f94a00fe9310c7b5</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>admin</sys_created_by>
        <sys_created_on>2019-03-06 19:20:47</sys_created_on>
        <sys_id>bcf42d994f003300f94a00fe9310c75c</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>Put_Disability</sys_name>
        <sys_package display_value="NeedIt" source="x_58872_needit">6ead8e780f603200cd674f8ce1050ed1</sys_package>
        <sys_policy/>
        <sys_scope display_value="NeedIt">6ead8e780f603200cd674f8ce1050ed1</sys_scope>
        <sys_update_name>sys_soap_message_function_bcf42d994f003300f94a00fe9310c75c</sys_update_name>
        <sys_updated_by>admin</sys_updated_by>
        <sys_updated_on>2019-03-06 19:20:47</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
